In [0]:
# Importando o pandas e o leitor de url
import pandas as pd
import io
import requests

In [0]:
# Lendo a url do arquivo csv
url = "https://raw.githubusercontent.com/dressalsl/tutorialPandas/master/usandoSelecionadores/bank.csv"
df = pd.read_csv(url, sep=';')

In [0]:
df.head()

   age          job  marital  education  ... pdays  previous poutcome   y
0   30   unemployed  married    primary  ...    -1         0  unknown  no
1   33     services  married  secondary  ...   339         4  failure  no
2   35   management   single   tertiary  ...   330         1  failure  no
3   30   management  married   tertiary  ...    -1         0  unknown  no
4   59  blue-collar  married  secondary  ...    -1         0  unknown  no

[5 rows x 17 columns]

In [0]:
# O método isin retorna os valores desejados para a coluna. Funciona como o operadorador OU

In [12]:
# Apresenta apenas os meses may e oct por single
df[(df.marital == "single") & (df.month.isin(["may", "oct"]))].head()

    age          job marital  education  ... pdays  previous poutcome   y
18   25  blue-collar  single    primary  ...    -1         0  unknown  no
39   23     services  single   tertiary  ...    -1         0  unknown  no
45   34   management  single   tertiary  ...    -1         0  unknown  no
58   36      retired  single  secondary  ...    -1         0  unknown  no
72   31   management  single   tertiary  ...    -1         0  unknown  no

[5 rows x 17 columns]

In [8]:
# Indica o número de linhas x colunas 
df[(df.marital == "married") & (df.education.isin(["primary", "secondary"]))].shape

(1953, 17)

In [14]:
# Com o isin é possivel fazer a mesma operação acima
filtro = df.isin({"marital" : ["married"], "education": ["primary", "secondary"]})
df[(filtro.marital) & (filtro.education)].shape

(1953, 17)